{
  "Angulimala": "The dramatic story of Angulimalas dual transformation from a diligent, virtuous student to a notorious serial killer, and once again, into a compassionate, spiritually perfect Arahant has been retold millions of times for over two thousand six hundred years. It has never failed to evoke powerful emotions in the reader or listener, both young and old. This presentation of \u001cAngulimala\u001d is designed to cater to a wide readership, ranging from young children, teenagers to adults. Parents can introduce the moral lessons of the story of Angulimala to their children as young as three years old, by reading, in sequence, the captions under each of the illustrations. The illustrations themselves unfold the life-episode of Angulimala to the child.",
  "Love Your Children the Right Way": "I composed this book when I was in Chiang Mai, where I lived for 10 years. In my work there, I observed many parents who had children but knew nothing about how to raise there beloved children properly so that they would grow to be good citizens of the nation. When I thought about this matter, I started writing an article concerning parents responsibility in raising their children - Panyananda Bhikkhu.",
  "Who's the Boss": "Who do you think the boss of the Body is? Well the heart thinks HE is. But is he? The other organs certainly don't agree. Find out how each one of them tried to convince the others, and you, why they are the boss. This is a great story about the nature of the body, with Illustrations by Joel Israel. [36 pages]",
  "In the Dead of Night": "\"I had been driving all day on a long, lonely, dusty road. Night had already fallen when I decided to rest. I still had a long way to go and I felt very tired.\" This book deals with people's fear and emotions with some scary, but humorous illustrations by Joel Israel. [42 pages]",
  "Dhammapada Stories": "Selected verses from the Dhammapada, all depicted with thirty-two beautiful illustrations. This collection is a great introduction to the Dhammapada and has been carefully compiled and edited for the younger reader by Gambhiro Bhikkhu. [126 pages]",
  "An Upside Down World": "Find out how the sad upside down world of four unhappy wanderers go the right side up again in this wonderful illustrated story book. Suitable for younger children, it includes some fun activities to do as you read along. This book has both colour and black & white Illustrations. [30 pages]",
  "The One-Who-Saw": "\"There once was a happy land where the inhabitants lived a happy and harmonious life. They were kind to one another and their ways were simple. Their wants were few...\" An illustrated Buddhist story about the \"One Who Saw\" combines Buddhist themes into a children's book. [42 pages]",
  "Rahula Leads the Way": "Rahula leads the Way [Print version only].",
  "Buddhist Tales for Young & Old (Vol. 1) 'Prince Goodspeaker' (Text Version)": "Fifty stories from the Jataka Tales - Prince Goodspeaker. Interpreted by Ven. Kurunegoda Piyatissa, Maha Thera and told by Todd Anderson. The Jataka stories, over millennia, have been seminal to the development of many civilisations, the cultivation of moral conduct and good behaviour, the growth of a rich and varied literature in diverse parts of the world and the inspiration for paintings, sculpture and architecture of enduring aesthetic value. The Buddha himself used Jataka stories to explain concepts like karma and rebirth and to emphasize the importance of moral values.",
  "Buddhist Tales for Young & Old (Vol. 1) 'Prince Goodspeaker' (Illustrated Version)": "This is an illustrated version of Buddhist Tales for Young and Old (volume 1), with line drawings by John Patterson, which are suitable for colouring in.",
  "Buddhist Tales for Young & Old (Vol. 2) 'King Fruitful' (Text Version)": "This is the second volume of fifty stories from the Jataka Tales - Buddhist Tales for Young and Old, interpreted by Ven. Kurunegoda Piyatissa, Maha Thera and told by Todd Anderson. These stories are not scholarly word-for-word translations as have been done by others. Rather these tales have been rewritten in modern English understandable by western readers. By reading these stories, children and adults can develop their knowledge and learn how to face the difficulties of modern life.",
  "Buddhist Tales for Young & Old (Vol. 2) 'King Fruitful' (Illustrated Version)": "This is the illustrated version of Buddhist Tales for Young and Old (volume 2), with line drawings by John Patterson, which are suitable for colouring in.",
  "Seeding the Heart": "This is a guide for teaching loving-kindness meditation to children. To learn about the radiating of loving-kindness to all beings with children, we have to tap into the store of knowledge accumulated by lay people and parents. It must be knowledge which has grown out of years of living and loving with children and young adults. Gregory Kramer, father of three boys, shows us here with subtle but precise adjustments in the standard practice of loving-kindness meditation he was able to anchor it in the lives of his children.BuddhaNet's Buddhist Studies for Schools eBooksThis is a selection of text and artwork from BuddhaNet's Buddhist Studies for Primary and Secondary students.",
  "Story of the Buddha Text Book - Primary Students": "Illustrated Biography of the Buddha, with each page including a line drawing with text in A4 size.",
  "Story of the Buddha Colouring Book -Primary Students": ".Colouring Book: Ninety-three A4 size line drawings of the \"Story of the Buddha\" suitable for colouring in.",
  "Guided Meditation for Primary Students": "This is a series of guided meditations with instruction for teachers for primary school students. This file is from BuddhaNet's Buddhist Studies for Primary Students section. The text includes seven guided meditations for students, with detailed instructions for teachers.",
  "Life of the Buddha for Secondary Students [A4 Size, Print Quality Only].": ".Life of the Buddha for Secondary Students with, sixty-four stories with linked exercises.",
  "Colour in a Buddha Picture": "Art and Craft for Primary students. [A4 Size Cut-out Buddha image].",
  "Colour in a Dharma Wheel": "Art and Craft for Primary students [A4 Size Cut-out Dharma wheel].",
  "Colour in a Lotus Flower": "Art and Craft for Primary students [A4 Size Cut-out Lotus flower].",
  "Colour in a Bodhi Leaf": "Art and Craft for Primary students [A4 Size Cut-out Bodhi leaf].",
  "Colour in a Buddhist Flag": "Art and Craft for Primary students [A4 Size Cut-out Buddhist flag].",
  "Colour in a Bodhi Leaf Painting for Vesak": "Art and Craft for Primary students [A4 Size Cut-out Vesak Bodhi leaf].",
  "Buddhist Greeting": "Art and Craft for Primary students [A4 Size Cut-out Buddhist greeting].",
  "Creating Vesak Gifts": "Art and Craft for Primary students [A4 Size Cut-out Vesak Cards and Gifts].",
  "Maha (Great) Buddhist Crossword Puzzles": "Test your Buddhist vocabulary with these Maha (great) crosswords. (Secondary level)Download Textbooks by the Buddhist Education Foundation (UK)",
  "Key Stage 1: Illustrated Textbook on Buddhism for children aged between 5-7.": "",
  "Key Stage 2: Illustrated Textbook on Buddhism for children aged between 7-11.": ""
}